## 🏗️ Terraform Plan Summary

**Environment:** 🧪 `dev`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=usTc4Q]
google_service_account.app: Refreshing state... [id=projects/doug-hayden-eng-sandbox/serviceAccounts/agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_storage_bucket.artifact_service: Refreshing state... [id=agent-foundation-dev-artifact-service-bac4dce1]
data.terraform_remote_state.main: Read complete after 0s
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.bucketViewer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/logging.logWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/serviceusage.serviceUsageConsumer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.objectUser/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/telemetry.tracesWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudtrace.agent/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/aiplatform.user/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_cloud_run_v2_service.app["us-central1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_cloud_run_v2_service" "app" {
      + annotations             = (known after apply)
      + binary_authorization    = (known after apply)
      + build_config            = (known after apply)
      + client                  = (known after apply)
      + client_version          = (known after apply)
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + custom_audiences        = (known after apply)
      + default_uri_disabled    = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = (known after apply)
      + description             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + iap_enabled             = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + invoker_iam_disabled    = (known after apply)
      + labels                  = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + multi_region_settings   = (known after apply)
      + name                    = "agent-foundation-dev"
      + observed_generation     = (known after apply)
      + reconciling             = (known after apply)
      + scaling                 = (known after apply)
      + template                = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic                 = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)
    }

  # google_cloud_run_v2_service.app["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev"
        name                    = "agent-foundation-dev"
        # (35 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
              ~ image          = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:5fb31831f8f0eee73534d3b2da4ff372a163a8f7972bdf9501bfb54cf94de3a4" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:681ee88f37d01cb5950458f8246ae07153a58bd59fd5c00c85d06713b1cddc9f"
                name           = null
                # (6 unchanged attributes hidden)

              - env {
                  - name  = "MEMORY_SERVICE_URI" -> null
                  - value = "agentengine://projects/136454482223/locations/us-central1/reasoningEngines/8356485183678971904" -> null
                }
              - env {
                  - name  = "SESSION_SERVICE_URI" -> null
                  - value = "agentengine://projects/136454482223/locations/us-central1/reasoningEngines/8356485183678971904" -> null
                }
              + env {
                  + name  = "MEMORY_SERVICE_URI"
                  + value = (known after apply)
                }
              + env {
                  + name  = "SESSION_SERVICE_URI"
                  + value = "postgresql+asyncpg://agent-foundation-dev@doug-hayden-eng-sandbox.iam@localhost:5432/agent_sessions"
                }

                # (15 unchanged blocks hidden)
            }
          + containers {
              + args       = (known after apply)
              + build_info = (known after apply)
              + image      = "gcr.io/cloud-sql-connectors/cloud-sql-proxy:2"

              + ports (known after apply)

              + resources (known after apply)

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 5
                  + period_seconds        = 5
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/readiness"
                      + port = 9090
                    }
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_project_iam_member.app["roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.app["roles/cloudsql.instanceUser"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/cloudsql.instanceUser"
    }

  # google_sql_database.sessions will be created
  + resource "google_sql_database" "sessions" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "agent-foundation-dev-sessions"
      + name            = "agent_sessions"
      + project         = "doug-hayden-eng-sandbox"
      + self_link       = (known after apply)
    }

  # google_sql_database_instance.sessions will be created
  + resource "google_sql_database_instance" "sessions" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_18"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "agent-foundation-dev-sessions"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "doug-hayden-eng-sandbox"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-central1"
      + replica_names                  = (known after apply)
      + root_password_wo               = (write-only attribute)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration (known after apply)

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + database_flags {
              + name  = "cloudsql.iam_authentication"
              + value = "on"
            }

          + insights_config (known after apply)

          + ip_configuration (known after apply)

          + location_preference (known after apply)

          + read_pool_auto_scale_config (known after apply)
        }
    }

  # google_sql_user.app will be created
  + resource "google_sql_user" "app" {
      + database_roles          = [
          + "cloudsqlsuperuser",
        ]
      + host                    = (known after apply)
      + iam_email               = (known after apply)
      + id                      = (known after apply)
      + instance                = "agent-foundation-dev-sessions"
      + name                    = "agent-foundation-dev@doug-hayden-eng-sandbox.iam"
      + password_wo             = (write-only attribute)
      + project                 = "doug-hayden-eng-sandbox"
      + sql_server_user_details = (known after apply)
      + type                    = "CLOUD_IAM_SERVICE_ACCOUNT"
    }

  # google_vertex_ai_reasoning_engine.memory_bank will be created
  + resource "google_vertex_ai_reasoning_engine" "memory_bank" {
      + create_time  = (known after apply)
      + description  = "Memory Bank Service for the agent-foundation-dev app"
      + display_name = "agent-foundation-dev Memory Bank"
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "doug-hayden-eng-sandbox"
      + region       = "us-central1"
      + update_time  = (known after apply)

      + spec {
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_run_services                          = {
      ~ us-central1 = {
          ~ latest_ready_revision = "agent-foundation-dev-00024-29q" -> (known after apply)
          ~ update_time           = "2026-03-23T18:20:21.662921Z" -> (known after apply)
          ~ uri                   = "https://agent-foundation-dev-645mxjt3sq-uc.a.run.app" -> (known after apply)
        }
    }
  + cloud_sql_instance_connection_name          = (known after apply)
  ~ configured_environment_variables            = {
      ~ MEMORY_SERVICE_URI                                 = "agentengine://projects/136454482223/locations/us-central1/reasoningEngines/8356485183678971904" -> (known after apply)
      ~ SESSION_SERVICE_URI                                = "agentengine://projects/136454482223/locations/us-central1/reasoningEngines/8356485183678971904" -> "postgresql+asyncpg://agent-foundation-dev@doug-hayden-eng-sandbox.iam@localhost:5432/agent_sessions"
        # (12 unchanged attributes hidden)
    }
  ~ deployed_image                              = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:5fb31831f8f0eee73534d3b2da4ff372a163a8f7972bdf9501bfb54cf94de3a4" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:681ee88f37d01cb5950458f8246ae07153a58bd59fd5c00c85d06713b1cddc9f"
  ~ memory_service_uri                          = "agentengine://projects/136454482223/locations/us-central1/reasoningEngines/8356485183678971904" -> (known after apply)
  ~ service_account_roles                       = [
        "roles/aiplatform.user",
      + "roles/cloudsql.client",
      + "roles/cloudsql.instanceUser",
        "roles/cloudtrace.agent",
        # (5 unchanged elements hidden)
    ]
  ~ session_service_uri                         = "agentengine://projects/136454482223/locations/us-central1/reasoningEngines/8356485183678971904" -> "postgresql+asyncpg://agent-foundation-dev@doug-hayden-eng-sandbox.iam@localhost:5432/agent_sessions"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"
```

</details>

---